artillery-workshop/demos/plug-in/demo/plug-in.yaml
config:
  target: http://localhost:3000
  phases:
    - duration: 1
      arrivalRate: 1
  plugins:
    demo: {
      message1: "Message 1",
      message2: "Message 2",
      experiments: {
        oneWebIe: variant
      }

    }
scenarios:
  - flow:
      - get:
          url: "/echo/1"
      - get:
          url: "/echo/2"
      - get:
          url: "/echo/3"
      - get:
          url: "/echo/4"
      - log: "FOOBAR"